# responses.py

join_responses = [
    "Добро пожаловать в ад, {tg}! 💀",
    "Ох, {tg}, кажется, я знаю, кто будет Пидором всегда... 🤡",
    "Ну что, {tg}, готов стать мемом? 😂",
    "{tg}, Добро пожаловать в Петушарню.. Петушара... 🐔💩",
    "А вот и {tg} — главный неудачник дня! 🤦‍♂️",
    "Ну что, {tg}, привет, дебил дня! 🤣",
    "{tg}, ты в нашем списке… и это худшее, что могло случиться. 🥴",
    "Ну что, {tg}, привет, главный еблан дня! 🤪",
    "Добро пожаловать, {tg}, в клуб самых тупых. 🧠💥",
    "Ну что, {tg}, тебя заметили. И это не хорошо. 🤡",
    "Вот и {tg}, Пидор дня. Ура! 🎉",
    "О, {tg}, тебе тут не место, но ты всё равно тут. 🤦‍♂️",
    "{tg}, ты точно станешь легендой… только не в хорошем смысле. 🏆"
]

pidor_responses = [
    "{name}, ну что, ты — Пидор дня! Все это знают, так что принимай свои почести. 🏆\n{tg}",
    "Поздравляю, {tg}, ты официально стал Пидором дня! Кто бы сомневался. 😂",
    "Ты достоин звания Пидора дня, {name}! Даже не пытайся оправдаться, все уже все поняли. 🤦‍♂️\n{tg}",
    "О да, {tg}, Пидор дня — это ты! Все чмошники с тобой поздравляют. 🥳",
    "Серьезно, {name}, Пидор дня? В этой жизни ты явно не на том месте. 🥂\n{tg}",
    "{name}, ты не просто Пидор дня, ты просто ходячий позор! Молись, чтобы это был твой пик. 🙄\n{tg}",
    "{tg}, ты снова на троне Пидора дня! Все, кто тебя видит, думают, что ты — полная ошибка. 💀",
    "{name}, ты наконец-то получил свой титул Пидора дня. Гордись, если можешь, урод. 😂\n{tg}",
    "Ну что, {tg}, не удивляешь! Пидор дня — твой титул, и никто не заберет его у тебя. 😜",
    "{name}, тебя можно поздравить с Пидором дня — ты точно не мог стать хуже, чем есть. 👏\n{tg}"
]

krasavchik_responses = [
    "{tg}, Красавчик дня! Восхищаемся твоим шармом! 😏",
    "Сегодня ты, {tg}, — Красавчик дня! 🌟",
    "Готовься к овациям, {tg} — ты Красавчик дня! 🎉",
    "{tg}, ты заслужил титул Красавчик дня! Все глазки на тебя. 👀",
    "Красавчик дня — это ты, {tg}! Тебе аплодируют! 👏",
    "{tg}, ты — тот самый Красавчик дня, который вдохновляет всех! 💫",
    "Сегодня твой день, {tg}, ты сияешь! ✨",
    "Похоже, все заметили, какой ты классный, {tg}! Красавчик дня! 😎",
    "Все взгляды на тебя, {tg}, ведь ты — Красавчик дня! 👑",
    "{tg}, ты лучишься как никогда, Красавчик дня! 🔥"
]
